/*********************************
* Class: MAGSHIMIM C2			 *
* Week 5           				 *
* HW solution   			 	 *
**********************************/
#include <stdio.h>

int main(void)
{
	int arr2d[3][3] = { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } };
	/*
	כאן הזיכרון מוקצה ברצף, ולכן גם אחרי ההסבה אנחנו נמצאים בתחילת האיזור בזיכרון שבו נמצאים כל המערכים.
	*/
	int* arr = (int*)arr2d;
	int i = 0;
	for (i = 0; i < 9; i++)
	{
		printf("%d ",arr[i]);
	}
	printf("\n\n");
	/*
	כאן שלושת המערכים הוקצו בנפרד, ואין לנו הבטחה היכן בדיוק הם הוקצו - אולי ברצף ואולי לא.
	*/
	int arr1[] = { 11, 12 };
	int arr2[] = { 13, 14, 15, 16 };
	int arr3[] = { 17, 18, 19 };
	/*
	ובכל מקרה, מערך המצביעים הוקצה במקום אחר, שאולי כלל אינו קרוב למיקום שבו הוקצו המערכים.
	לכן כשאנחנו עושים הסבה למצביע למספר שלם, כלל אין קשר למיקום של המספרים עצמם. 
	המספרים הראשונים שיודפסו למסך הם בכלל הכתובות של שלושת מערכי המספרים ארר1, ארר2, ארר3
	ולאחר מכן אין לדעת מה יודפס - זו כבר שגיאת 
	buffer overflow
	*/
	int* pArr[3] = { arr1, arr2, arr3 };
	int* pArr1d = (int*)pArr;
	for (i = 0; i < 9; i++)
	{
		printf("%d ", pArr1d[i]);
	}
	getchar();	
	return 0;
}